# -*- coding: utf-8 -*-
# ---------------------------------------
#   程序：arrow 库
#   版本：1.0
#   作者：zhong
#   日期：2017-05-09
#   语言：Python 2.7
# ---------------------------------------

# 创建、操作、格式化和转换日期、时间和时间戳
# ==> 可用性提高,
import arrow

# 获取当前时间 注意到 需要转化时区 默认时区是
utc = arrow.utcnow()
# 操作时间戳
modiUtc = utc.replace(hours=-1)
# 当前时间本地化
local = utc.to('local')
# 转换为 utc
rutc = local.to('utc')
# 时间戳
timestamp = local.timestamp
# 格式化
loc = local.format()
# 带参数格式化
locP = local.format('YYYY-MM-DD HH:mm:ss')

# ======================================================================================================================
# 概念
# ======================================================================================================================

# 时区(UTC)
# ==> 规定: 英国(格林尼治天文台旧址)为中时区(零时区)、东1-12区、西1-12区
# ==> 常识:
#     1. 每个时区横跨经度15°, 时间为1个小时
#     2. 向西走, 每过一个时区, 时间减去一个小时; 向东走, 每过一个时区, 时间增加一个小时
# ==> 例子: 2017-05-09T02:24:06.379278+00:00
#     1.+00:00  UTC偏移量描述

# ======================================================================================================================
# 创建 creation
# ======================================================================================================================

## 获取时间
# 获取中时区(零时区)时间
utc = arrow.utcnow()
# 获取当地时间
local = arrow.now()
# 获取指定地区的时间
tzt = arrow.now('US/Pacific')

## 通过时间戳得到时间
# 从数字
tfi = arrow.get(1494296646)
# 从字符串
tfs = arrow.get('1494296646')
# 从小数
tfd = arrow.get(1494296646.152325)
# 从小数字符串
tfds = arrow.get('1494296646.152325')


print(utc)