# -*- coding: utf-8 -*-
# ---------------------------------------
#   程序：统计思维: 程序员数学之概率统计
#   英文：Probability And Statistics for Programmers
#   地址：https://www.gitbook.com/book/jobrest/statistical-thinking/details
#   版本：1.0
#   作者：zhong
#   日期：2017-04-18
#   语言：Python 2.7
#   操作：
#   功能：
# ---------------------------------------

# ---------------------------------------
# 一:
#   1. 均值(mean)和平均值(average)
#       a.定义
#         ==> 均值: 如果一个包含n个值的样本xi, 那么它们的均值μ就等于这些值的总和除以值的数量
#       b.区别
#         ==> 1. 样本的均值是根据公司计算出来的一个汇总统计量;
#         ==> 2. 平均值是若干种可以用于描述样本的典型值或集中趋势的汇总统计量之一。
#   2. 方差和标准差
#      ==> 均值描述集中趋势, 方差描述分散情况
#   3. 分布
#      ==> a. 分布描述了各个值出现的频繁程度
#      ==> b. 表示分布的最常用的方法是直方图(histogram), 用于展示各个值出现的频数或概率
#      ==> c. 计算频数, 通过如下方法, 得到一个将值映射到其频数的字典
#          hist = {}
#          for x in t:
#            hist[x] = hist.get(x, 0) + 1
#      ==> d. 归一化(normalizaiton): 将如上字典除以n即可把频数转换成概率
#          n = float(len(t))
#          pmf = {}
#          for x, freq in hist.items():
#            pmf[x] = freq / n
#      ==> e. 归一化后的直方图称为 PMF (Probability Mass Function, 概率质量函数)
#   4. 直方图
import matplotlib.pyplot as pyplot

pyplot.pie([1, 2, 3])
pyplot.show()
#
# ---------------------------------------

# ---------------------------------------
# 一: 术语
#     a. 汇总统计量(summary statistic)
#        ==> 通过计算将一个数据集归结到一个数字(或者是少量的几个数字), 而这个数字能表示数据的某些特点。
#     b. 重编码(recode)
#        ==> 通过对原始数据进行计算或是其他逻辑处理得到的值
#     c. 横断面研究(cross-sectional study)
#        ==> 收集群体在特定时间点的数据的研究
#     d. 纵贯研究(longitudinal study)
#        ==> 跟踪群体, 随着时间推移对同一组人反复采集数据的研究
#     e. 统计显著性(statistically significant)
#        ==> 若一个直观效应不太可能是由随机因素引起的, 就是统计显著的
#     f. 直观效应(apparent effect)
#        ==> 表示发生了某种有意思的事情的度量或汇总统计量
#
# ---------------------------------------